p2z = {
    "ni3": "ㄋㄧˇ",
    "hao3": "ㄏㄠˇ",
    "zhong1": "ㄓㄨㄥ",
    "wen2": "ㄨㄣˊ",
    "zhong4": "ㄓㄨㄥˋ",
    "xin1": "ㄒㄧㄣ",
    "jiao4": "ㄐㄧㄠˋ",
    "yu4": "ㄩˋ",
    "bu4": "ㄅㄨˋ",
    "lu3": "ㄌㄨˇ",
    "dan4": "ㄉㄢˋ",
    "ȇ4": "ㄝˋ",
}

p2z_u2v = {
    "lü4": "ㄌㄩˋ",
    "zui3": "ㄗㄨㄟˇ",
    "lv4": "ㄌㄩˋ",
    "guo1": "ㄍㄨㄛ",
    "lve4": "ㄌㄩㄝˋ",
    "gao1": "ㄍㄠ",
    "yi1": "ㄧ",
    "chou2": "ㄔㄡˊ",
    "lüe4": "ㄌㄩㄝˋ",
    "dong3": "ㄉㄨㄥˇ",
    "lu3": "ㄌㄨˇ",
    "dan4": "ㄉㄢˋ",
    "lü2": "ㄌㄩˊ",
    "zi5": "˙ㄗ", 
}

z2p = {v: k for k, v in p2z.items()}

z2p_u2v = {v: k for k, v in p2z_u2v.items()}
